#include <iostream>
#include <string>
#include <cstdlib>
#include <ctime>
#include <windows.h>
// Состояние игры (базовые переменные)
int hp = 100;
int resources = 50; // Деньги / Мана / Патроны / Крышки
int score = 0; // Очки выживания (цель — рекорд)
int turn = 1;
void printHUD() {
 std::cout << "\n================ [ХОД: " << turn << " | СЧЕТ: " << score
<< "] ================\n";
 std::cout << "❤️ Здоровье: " << hp << "/100 |  Ресурсы: " <<
resources << "\n";
 std::cout << "--------------------------------------------------------\n";
}
// -------------------------------------------------------------
// [МЕСТО ДЛЯ ФУНКЦИЙ РАЗРАБОТЧИКОВ ИЗ PULL REQUEST'ОВ]
// -------------------------------------------------------------
int main() {
SetConsoleOutputCP(CP_UTF8);
SetConsoleCP(CP_UTF8);
 srand(time(NULL));
 int choice = 0;
 std::cout << ">>> ЗАПУСК СИМУЛЯЦИИ: БИТВА ЗА РЕКОРД <<<\n";
 while (hp > 0) {
 printHUD();
 std::cout << "1. Рискованная операция (Высокая награда / Высокийриск)\n";
 std::cout << "2. База / Лагерь (Лечение и обмен ресурсов)\n";
 std::cout << "3. Особое событие / Рулетка удачи\n";
 std::cout << "0. Сдаться и зафиксировать счет\n";
 std::cout << "Выберите действие > ";
 if (!(std::cin >> choice)) break;
 switch (choice) {
 case 1:
 // [РАЗРАБОТЧИК 1: ПОДКЛЮЧИТ ФУНКЦИЮ РИСКА (ISSUE #1)]
 std::cout << "\n[!] Модуль риска еще в разработке (Issue#1).\n";
    break;
 case 2:
 
   std::cout << "\nВы решили разбить лагерь\n";
   std::cout << "Что хотите сделать?\n";

   std::cout << "1. Отдых\n";
   std::cout << "2. Заговорить с прохожим\n";
   std::cout << "3. Сортировка сумки\n";
   std::cout << "4. Купить зелье\n";

   int campChoice; 
    
   std::cin >> campChoice; 

    switch (campChoice) {
        case 1:
            std::cout << "Вы легли отдохнуть и восстановили силы.\n";
            std::cout << "---Востановленно 10 HP---\n";
            if (hp <= 90){
               hp += 10;
            }
            else {
               hp +=0;
            }
            break;
            
        case 2:
            std::cout << "Вы видите как к вам приближается человек в плаще.\n";
            std::cout << "Он приветствует вас и просит позволить ему отдохнуть в вашем лагере.\n";
            std::cout << "После непродолжительного общения он оскорбляется из-за вашей неудачной шутки\n";
            std::cout << "---В ходе драки вы теряете 5 hp---\n";
            hp -= 5;
            std::cout << "Незнакомец угрожает тем, что пойдёт в полицию\n";
            std::cout << "Вы откупаетесь, чтобы не нажить ещё проблем\n";
            std::cout << "---Вы потеряли 10 монет---\n";
            resources -= 10;
            break;
            
        case 3:
            std::cout << "Вы решили навести порядок в сумке.\n";
            std::cout << "Крыса пробегает между ваших ног\n";
            std::cout << "От страха вы подскакиваете\n";
            std::cout << "Чан с супом опрокидывается вам на лицо\n";
            std::cout << "---Вы теряете 40 hp---\n";
            hp -= 40;
            break;

         case 4: 
            if (hp <= 80) {
            std::cout << "Использовано: зеркало связи\n";
            std::cout << "---Потрачено 20 монет---\n";
            resources -= 20;
            std::cout << "Ваш знакомый волшебник продаёт вам зелье\n";
            std::cout << "---Употреблено зелье лечения---\n";
            std::cout << "---hp пополнено на 20 единиц---\n";
            hp += 20;
            }
            else {
               std::cout << "Вам незачем употреблять зелье";
            }
        default:
            std::cout << "Неверный пункт меню, попробуйте еще раз.\n";
            break;
    }

    break;
 



 case 3:
 // [РАЗРАБОТЧИК 3: ПОДКЛЮЧИТ РУЛЕТКУ/БОССА (ISSUE #3)]
 std::cout << "\n[!] Модуль событий еще в разработке (Issue#3).\n";
 break;
 case 0:
 hp = 0;
 break;
 default:
 std::cout << "\nНеизвестная команда!\n";
 break;
 }
 // Каждый успешный ход дает очки выживания
 if (hp > 0) {
 turn++;
 score += 10;
 }
}
 std::cout << "\n💀 ИГРА ОКОНЧЕНА. Ваш итоговый рекорд: " << score << "очков!\n";

 return 0;

 }